app/views/paseadors/index_paseador_veterinario.html.erb

          <div class="col-md-3">
            <%= select_tag :filter, options_for_select(Paseador.service_types.keys.map { |k| [k.humanize, k] }, params[:filter]), class: "form-control", include_blank: "Seleccione Tipo de Servicio" %>
---
SELECT "paseadors".* FROM "paseadors"

          <div class="col-md-3">
            <%= select_tag :plaza_filter, options_for_select(Plaza.pluck(:nombre, :id), params[:plaza_filter]), class: "form-control", include_blank: "Seleccione Plaza" %>
---
SELECT "plazas"."nombre", "plazas"."id" FROM "plazas"

            <% if paseador.plaza_id.present? %>
              <% plaza = Plaza.find_by(id: paseador.plaza_id) %>
---
SELECT "plazas".* FROM "plazas" WHERE "plazas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]