app/views/perros/historia_clinica.html.erb

        <i class="material-icons small left grey" style="margin-right: 10px;">today</i>
        <h2 style="margin-top: 4px; font-weight: 200;"> Historia Clínica de <%= @turnos.first.perro.nombre %></h2>
---
SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

          <i class="material-icons extraextrasmall">person</i>
          <strong>Dueño:</strong> <%= @turnos.first.perro.persona.nombre %> <%= @turnos.first.perro.persona.apellido %>
---
SELECT "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]