app/views/perros/libreta_sanitaria.html.erb

SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      <i class="material-icons small left grey" style="margin-right: 10px;">today</i>
      <h2 style="margin-top: 4px; font-weight: 200;"> Libreta Sanitaria de <%= @turnos.first.perro.nombre %></h2>