app/mailers/user_mailer.rb

SELECT "tipo_turnos".* FROM "tipo_turnos" WHERE "tipo_turnos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def turno_pend(user, tipoturnoid, perroid, eldia)
    @user = user
    @tipoturnoid = tipoturnoid
    @perroid = perroid
    @eldia = eldia
    @tipoturno = TipoTurno.find(@tipoturnoid)
    @perro = Perro.find(@perroid)