app/views/personas/index.html.erb

SELECT "perros".* FROM "perros" WHERE "perros"."persona_id" = $1  [["persona_id", 2]]
---
                  <td>
                    <%= form_with(url: baja_persona_path(persona.id), method: :post, class: 'confirm-form', data: { has_turnos_pendientes: persona.perros_con_turnos_pendientes.any?, perros_con_turnos_pendientes_details: persona.perros_con_turnos_pendientes_detalles }) do |form| %>