app/controllers/campania_donacions_controller.rb

  def vistaUsuario
    @campanias = CampaniaDonacion.all
---
SELECT "campania_donacions".* FROM "campania_donacions"

  def vistaVeterinario
    @campanias = CampaniaDonacion.all
---
SELECT "campania_donacions".* FROM "campania_donacions"

  def vistaPublica
   @campanias = CampaniaDonacion.all
---
SELECT "campania_donacions".* FROM "campania_donacions"