app/controllers/encontrados_controller.rb

  def index_encontrado_visitante
    @encontrados = Encontrado.order(:estado)
---
SELECT "encontrados".* FROM "encontrados" ORDER BY "encontrados"."estado" ASC