app/controllers/paseadors_controller.rb

    def index_paseador_usuario
        @paseadors = Paseador.all
---
SELECT "paseadors".* FROM "paseadors"

    def index_paseador_veterinario
        @paseadors = Paseador.all
---
SELECT "paseadors".* FROM "paseadors"