app/controllers/perros_controller.rb

SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def ver_info_perro
      @perro = Perro.find(params[:id])

SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "turnos".* FROM "turnos" WHERE "turnos"."perro_id" = $1 AND "turnos"."estado" = $2 ORDER BY "turnos"."id" ASC LIMIT $3  [["perro_id", 3], ["estado", 3], ["LIMIT", 1]]
---
    def historia_clinica
      @perro = Perro.find(params[:id])
      @turnos = Turno.where(perro: @perro, estado: Turno.estados[:presente])

SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def libreta_sanitaria
      @perro = Perro.find(params[:id])

SELECT "perros".* FROM "perros"
---
    def index
      @perros = Perro.all