app/controllers/personas_controller.rb

  def index
    @personas = if params[:nombre_apellido].present?
      # Persona.where("nombre LIKE ? OR apellido LIKE ?", "%#{params[:nombre_apellido]}%", "%#{params[:nombre_apellido]}%")
      palabras = params[:nombre_apellido].split
      condiciones = palabras.map do |palabra|
        "(LOWER(nombre) LIKE :keyword OR LOWER(apellido) LIKE :keyword)"
      end
      condiciones_sql = condiciones.join(" AND ")
      condiciones_hash = palabras.map { |palabra| { keyword: "%#{palabra.downcase}%" } }
      Persona.joins(:user).where(condiciones_sql, *condiciones_hash).where(users: { role: 'cliente', is_active: true })
---
SELECT "personas".* FROM "personas" INNER JOIN "users" ON "users"."id" = "personas"."user_id" WHERE "users"."role" != $1  [["role", 1]]

  def show_mydata
    @persona = current_user.persona
    # @perros = @persona.perros
    @perros = @persona.perros.where(is_active: true)
---
SELECT "perros".* FROM "perros" WHERE "perros"."persona_id" = $1 AND "perros"."is_active" = $2  [["persona_id", 2], ["is_active", true]]