app/controllers/turnos_controller.rb

  def index
    @turnos = Turno.where(estado: 'pendiente')
---
SELECT "turnos".* FROM "turnos" WHERE "turnos"."estado" = $1  [["estado", 0]]

  def mostrarTodos
    @turnos = Turno.all.order(:estado, :dia)
---
SELECT "turnos".* FROM "turnos" ORDER BY "turnos"."estado" ASC, "turnos"."dia" ASC

  def create
    @turno = Turno.new(turno_params)
    @turno.estado ||= "pendiente"

    if @turno.save
---
INSERT INTO "turnos" ("dia", "franja_horaria", "estado", "monto", "created_at", "updated_at", "perro_id", "tipo_turno_id", "dosis", "descripcion", "peso", "hora") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def turnos_del_dia
    @turnos = Turno.where(dia: Date.today, estado: 1)
---
SELECT "turnos".* FROM "turnos" WHERE "turnos"."dia" = $1 AND "turnos"."estado" = $2  [["dia", "2024-03-04"], ["estado", 1]]

  def presente
    @turno = Turno.find(params[:id])
---
SELECT "tipo_turnos".* FROM "tipo_turnos" WHERE "tipo_turnos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "turnos".* FROM "turnos" WHERE "turnos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]