app/models/persona.rb

  def perros_con_turnos_pendientes_detalles
    detalles = perros_con_turnos_pendientes.map do |perro|
      "#{perro.nombre}: #{perro.turno.where(estado: ['pendiente', 'aceptado']).count} turnos pendientes."
---
SELECT COUNT(*) FROM "turnos" WHERE "turnos"."perro_id" = $1 AND "turnos"."estado" IN ($2, $3)  [["perro_id", 1], ["estado", 0], ["estado", 1]]