app/models/turno.rb

    def turno_duplicado
        existing_turno = Turno.find_by(tipo_turno_id: tipo_turno_id, perro_id: perro_id)
---
SELECT "turnos".* FROM "turnos" WHERE "turnos"."tipo_turno_id" = $1 AND "turnos"."perro_id" = $2 LIMIT $3  [["tipo_turno_id", 6], ["perro_id", 1], ["LIMIT", 1]]

    def edad_minima_vacuna_tipo_a
        turno = Turno.find_by(tipo_turno_id: tipo_turno_id, perro_id: perro_id)
        perro = Perro.find_by(id: perro_id)
        tipo_turno = TipoTurno.find_by(id: tipo_turno_id)
---
SELECT "turnos".* FROM "turnos" WHERE "turnos"."tipo_turno_id" = $1 AND "turnos"."perro_id" = $2 LIMIT $3  [["tipo_turno_id", 6], ["perro_id", 1], ["LIMIT", 1]]
SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tipo_turnos".* FROM "tipo_turnos" WHERE "tipo_turnos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def edad_minima_vacuna_tipo_b
        turno = Turno.find_by(tipo_turno_id: tipo_turno_id, perro_id: perro_id)
        perro = Perro.find_by(id: perro_id)
        tipo_turno = TipoTurno.find_by(id: tipo_turno_id)
---
SELECT "turnos".* FROM "turnos" WHERE "turnos"."tipo_turno_id" = $1 AND "turnos"."perro_id" = $2 LIMIT $3  [["tipo_turno_id", 6], ["perro_id", 1], ["LIMIT", 1]]
SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tipo_turnos".* FROM "tipo_turnos" WHERE "tipo_turnos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def edad_minima_castracion
        turno = Turno.find_by(tipo_turno_id: tipo_turno_id, perro_id: perro_id)
        perro = Perro.find_by(id: perro_id)
        tipo_turno = TipoTurno.find_by(id: tipo_turno_id)
---
SELECT "turnos".* FROM "turnos" WHERE "turnos"."tipo_turno_id" = $1 AND "turnos"."perro_id" = $2 LIMIT $3  [["tipo_turno_id", 6], ["perro_id", 1], ["LIMIT", 1]]
SELECT "perros".* FROM "perros" WHERE "perros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tipo_turnos".* FROM "tipo_turnos" WHERE "tipo_turnos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]