app/views/turnos/new.html.erb

                <div class="field">
                  <%= form.collection_select(:perro_id, current_user.persona.perros.where(is_active: true, is_lost: false), :id, :nombre, { prompt: '  ¿Para qué perro es?' }, {class: 'custom-select-collection'}) %>
---
SELECT "perros".* FROM "perros" WHERE "perros"."persona_id" = $1 AND "perros"."is_active" = $2 AND "perros"."is_lost" = $3  [["persona_id", 2], ["is_active", true], ["is_lost", false]]
SELECT "personas".* FROM "personas" WHERE "personas"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

                <div class="field">
                  <%= form.collection_select(:tipo_turno_id, TipoTurno.all, :id, :nombre, {prompt: 'Tipo de Turno'}, {class: 'custom-select-collection'}) %>
---
SELECT "tipo_turnos".* FROM "tipo_turnos"